title: Carbon Black Cloud Live Response Usage on Windows
id: e61433e1-fb07-46ba-a369-4af52dba8ca5
status: experimental
description: This rule detects the usage of Live Response exec and execfg commands from Carbon Black Cloud Live Response on a Windows host.
references:
    - https://docs.vmware.com/en/VMware-Carbon-Black-Cloud/services/carbon-black-cloud-user-guide/GUID-7399B083-D65C-40ED-A831-460F7216F748.html
tags:
    - attack.execution
    - attack.t1059
author: SecurityAura
date: 2024/02/25
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: 'C:\Program Files\Confer\BladeRunner.exe'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Legitimate usage of Carbon Black Cloud Live Response on an endpoint
level: informational
