title: Carbon Black Cloud Live Query Usage on Windows
id: ab998e42-f7d4-4efd-ac0a-4487c1f644fe
status: experimental
description: This rule detects the usage of Live Query queries from Carbon Black Cloud on a Windows host.
references:
    - https://docs.vmware.com/en/VMware-Carbon-Black-Cloud/services/carbon-black-cloud-user-guide/GUID-129D4F84-1BF0-49F3-BF95-83002FD63217.html
tags:
    - attack.execution
    - attack.t1059
author: @SecurityAura
date: 2024/03/02
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: 'C:\Program Files\Confer\Blades\LiveQuery\osqueryi.exe'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Legitimate usage of Carbon Black Cloud Live Query on an endpoint
level: informational
