title: Carbon Black Cloud Live Response Usage on Linux
id: 55308b44-289a-4d0e-bb88-5f3a446a2e75
status: experimental
description: This rule detects the usage of Live Response exec and execfg commands from Carbon Black Cloud Live Response on a Linux host.
references:
    - https://docs.vmware.com/en/VMware-Carbon-Black-Cloud/services/carbon-black-cloud-user-guide/GUID-7399B083-D65C-40ED-A831-460F7216F748.html
tags:
    - attack.execution
    - attack.t1059
author: SecurityAura
date: 2024/03/02
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        ParentImage: '/opt/carbonblack/psc/bin/cbagentd'
        ImagePath: '/usr/bin/bash'
    condition: selection
fields:
    - CommandLine
    - TargetImage
    - TargetCommandLine
falsepositives:
    - Legitimate usage of Carbon Black Cloud Live Response on an endpoint
level: informational
