title: CrowdStrike Real Time Response Usage on Windows
id: e9a68255-3ba3-46ab-832d-386a1342b8d2
status: experimental
description: This rule detects the usage of Real Time Response from CrowdStrike on a Windows host.
references:
    - https://www.crowdstrike.com/resources/videos/how-real-time-response-empowers-incident-response/
tags:
    - attack.execution
    - attack.t1059
author: SecurityAura
date: 2024/03/23
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: 'C:\Program Files\Confer\Blades\LiveQuery\osqueryi.exe'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Legitimate usage of CrowdStrike Real Time  Response on an endpoint
level: informational
