title: SentinelOne Remote Script Orchestration Usage on Windows
id: 66ed47a1-fb2c-4fee-981a-79b2f02ee205
status: experimental
description: This rule detects the usage of Remote Script Orchestration (RSO) from SentinelOne on a Windows host.
references:
    - TO BE ADDED
tags:
    - attack.execution
    - attack.t1059
author: SecurityAura
date: 2024/03/02
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|contains|all: 
          - 'C:\Program Files\SentinelOne\Sentinel Agent'
          - 'AddonHost.exe'
        Image|endswith: 'powershell.exe'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Legitimate usage of SentinelOne Remote Script Orchestration on an endpoint
level: informational
